hikuinc/hiku_stm32_fw/Src/main.c
  /* Initialize ADC peripheral according to the passed parameters */
  if (HAL_ADC_Init(&AdcHandle) != HAL_OK) Error_Handler();
  
  /* ### - 2 - Start calibration ############################################ */
  if (HAL_ADCEx_Calibration_Start(&AdcHandle) != HAL_OK) Error_Handler();
  
  /* ### - 3 - Channel configuration ######################################## */
  adc_sConfig.Channel      = SCAN_VOUT_ADC_CHANNEL;
  adc_sConfig.Rank         = ADC_RANK_CHANNEL_NUMBER;
  adc_sConfig.SamplingTime = ADC_SAMPLETIME_7CYCLES_5;
  if (HAL_ADC_ConfigChannel(&AdcHandle, &adc_sConfig) != HAL_OK) Error_Handler();

	if (HAL_TIM_PWM_Start_IT(&TimHandleSp, SCAN_SP_TIM_CHANNEL)!= HAL_OK) Error_Handler();	
}

void Mic_Configuration() {
  TIM_HandleTypeDef    TimHandle;
  /* Timer Output Compare Configuration Structure declaration */
  TIM_OC_InitTypeDef sConfig;
	
	/*## Configure the TIM peripheral to output 1MHz microphone clock #######################################*/
  TimHandle.Instance = TIMx;
	/* Compute the prescaler value to have TIM3 counter clock equal to 16000000 Hz */
  TimHandle.Init.Prescaler         = (uint32_t)(SystemCoreClock / 16000000) - 1;
  TimHandle.Init.Period            = PERIOD_VALUE;
  TimHandle.Init.ClockDivision     = 0;
  TimHandle.Init.CounterMode       = TIM_COUNTERMODE_UP;
  TimHandle.Init.RepetitionCounter = 0;
  if (HAL_TIM_PWM_Init(&TimHandle) != HAL_OK) Error_Handler();

  /*## Configure PWM channel 4 on timer 3 to output on PB1 #########################################*/
  /* Common configuration for all channels */
  sConfig.OCMode       = TIM_OCMODE_PWM1;
  sConfig.OCPolarity   = TIM_OCPOLARITY_HIGH;
  sConfig.OCFastMode   = TIM_OCFAST_DISABLE;
  sConfig.OCNPolarity  = TIM_OCNPOLARITY_HIGH;
  sConfig.OCIdleState  = TIM_OCIDLESTATE_RESET;
  sConfig.OCNIdleState = TIM_OCNIDLESTATE_RESET;
  sConfig.Pulse = PULSE3_VALUE;
  if (HAL_TIM_PWM_ConfigChannel(&TimHandle, &sConfig, TIM_CHANNEL_4) != HAL_OK) Error_Handler();
  /* Output microphone clock signal */
  if (HAL_TIM_PWM_Start(&TimHandle, TIM_CHANNEL_4) != HAL_OK) Error_Handler();

	/* Configure the PDM library */
  PDMDecoder_Init(DEFAULT_AUDIO_IN_FREQ, DEFAULT_AUDIO_IN_CHANNEL_NBR);

  /*## Configure the SPI as a slave interface #######################################*/
  SpiHandle.Instance               = SPIx;
  SpiHandle.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_32;
  SpiHandle.Init.Direction         = SPI_DIRECTION_2LINES_RXONLY;
  SpiHandle.Init.CLKPhase          = SPI_PHASE_1EDGE;
  SpiHandle.Init.CLKPolarity       = SPI_POLARITY_HIGH;
  SpiHandle.Init.CRCCalculation    = SPI_CRCCALCULATION_DISABLED;
  SpiHandle.Init.CRCPolynomial     = 7;
  SpiHandle.Init.DataSize          = SPI_DATASIZE_8BIT;
  SpiHandle.Init.FirstBit          = SPI_FIRSTBIT_MSB;
  SpiHandle.Init.NSS               = SPI_NSS_SOFT;
  SpiHandle.Init.TIMode            = SPI_TIMODE_DISABLED;
  SpiHandle.Init.NSSPMode          = SPI_NSS_PULSE_DISABLED;
  SpiHandle.Init.CRCLength         = SPI_CRC_LENGTH_8BIT;
  SpiHandle.Init.Mode              = SPI_MODE_SLAVE;
  if (HAL_SPI_Init(&SpiHandle) != HAL_OK) Error_Handler();
	
	HAL_NVIC_SetPriority(SPIx_DMA_RX_IRQn, 0x02, 0x00);
	
if(HAL_SPI_Receive_DMA(&SpiHandle, (uint8_t *)InternalBuffer, 2*INTERNAL_BUFF_SIZE) != HAL_OK) Error_Handler();

}

GPIO_PinState is_command_mode() {
	GPIO_InitTypeDef GPIO_InitStruct;

	USARTx_RX_GPIO_CLK_ENABLE();

  GPIO_InitStruct.Pin       = USARTx_RX_PIN;
  GPIO_InitStruct.Mode      = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_HIGH;
  
  HAL_GPIO_Init(USARTx_RX_GPIO_PORT, &GPIO_InitStruct);

	return HAL_GPIO_ReadPin(USARTx_RX_GPIO_PORT, USARTx_RX_PIN);
}

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{	
  zbar_decoder_t *decoder;
  zbar_scanner_t *scanner;
	uint8_t cmdBuffer[1];
  TIM_HandleTypeDef    TimHandle;
  uint32_t scan_lines = 0;
  uint32_t scans = 0;
	uint32_t i;
	FLASH_EraseInitTypeDef EraseInitStruct;
	uint32_t PageError = 0;

		
  /* STM32F0xx HAL library initialization */
  HAL_Init();
	
  /* Configure the system clock to have a system clock = 48 Mhz */
  SystemClock_Config();

	if (is_command_mode() == GPIO_PIN_RESET) {
		HAL_FLASH_Unlock();
	  scanCmd = SCAN_CMD_MIC_SCAN_INSTANT;
	}
	
	Img_Scanner_Configuration();

	UART_Config(SCAN_CMD_NONE);

	AudioPacketBuf[0] = ScanPacketBuf[0] = (PACKET_HDR >> 24) & 0xFF;
	AudioPacketBuf[1] = ScanPacketBuf[1] = (PACKET_HDR >> 16) & 0xFF;
	AudioPacketBuf[2] = ScanPacketBuf[2] = (PACKET_HDR >> 8) & 0xFF;
	AudioPacketBuf[3] = ScanPacketBuf[3] = PACKET_HDR & 0xFF;
	AudioPacketBuf[PACKET_TYPE_FIELD] = PKT_TYPE_AUDIO;
	ScanPacketBuf[PACKET_TYPE_FIELD] = PKT_TYPE_SCAN;
	AudioPacketBuf[PACKET_LEN_FIELD] = (AUDIO_PAYLOAD_LEN >> 8) & 0xFF;
	AudioPacketBuf[PACKET_LEN_FIELD+1] = AUDIO_PAYLOAD_LEN & 0xFF;

	scan_decoded = 0;
	stop_audio = 0;

	sendSWVersion();
		
	cmdBuffer[0] = 0;
	while (scanCmd == SCAN_CMD_NONE) {
				uint32_t uart_state;
				HAL_UART_Receive_DMA(&UartHandle, cmdBuffer, 1);
				do {
					uart_state = HAL_UART_GetState(&UartHandle);
				} while ((uart_state == HAL_UART_STATE_BUSY) || (uart_state == HAL_UART_STATE_BUSY_RX) || (uart_state == HAL_UART_STATE_BUSY_TX_RX));
				for (i=0; i<SCAN_CMD_NONE; i++)
					if (scan_commands[i].cmdChar == cmdBuffer[0]) {
						scanCmd = scan_commands[i].scanCmd;
						break;
					}
	}

	switch (scanCmd) {
			case SCAN_CMD_MIC: 
				Mic_Configuration(); 
				while(1);
			case SCAN_CMD_MIC_SCAN: 
			case SCAN_CMD_MIC_SCAN_INSTANT:
				Mic_Configuration();
			case SCAN_CMD_SCAN:
				cmos_sensor_state = CMOS_SENSOR_READY;
				setScannerLED(1);
				break;
			case SCAN_CMD_SCAN_DEBUG:
				// set higher baud rate for transferring debug data
				UART_Config(SCAN_CMD_SCAN_DEBUG);
				cmos_sensor_state = CMOS_SENSOR_READY;
			  AudioPacketBuf[PACKET_TYPE_FIELD] = PKT_TYPE_SCAN_DEBUG;
				AudioPacketBuf[PACKET_LEN_FIELD] = (IMAGE_COLUMNS >> 8) & 0xFF;
		    AudioPacketBuf[PACKET_LEN_FIELD+1] = IMAGE_COLUMNS & 0xFF;
				setScannerLED(1);
				break;
			case SCAN_CMD_LIGHT_ONLY:
				setScannerLED(1);
				while(1);
			case SCAN_CMD_FLASH_ERASE:
				HAL_FLASH_Unlock();
				EraseInitStruct.TypeErase = TYPEERASE_PAGES;
        EraseInitStruct.PageAddress = FLASH_USER_START_ADDR;
        EraseInitStruct.NbPages = (FLASH_USER_END_ADDR - FLASH_USER_START_ADDR) / FLASH_PAGE_SIZE;
        HAL_FLASHEx_Erase(&EraseInitStruct, &PageError);
			  HAL_FLASH_Lock();
				while(1);
			default:
				while(1);
		}
					
	decoder = zbar_decoder_create();
	scanner = zbar_scanner_create(decoder);
	zbar_decoder_set_handler(decoder, symbol_handler);

	zbar_scanner_new_scan(scanner);
	
	cmdBuffer[0] = 0;
	HAL_UART_Receive_DMA(&UartHandle, cmdBuffer, 1);
		
	while(1) {
		if (cmdBuffer[0] == 'B') {
			setScannerLED(0);
			stop_audio = 1;
			while(1);
		}
		if (scan_decoded && (scanCmd != SCAN_CMD_SCAN_DEBUG)) {
			uint32_t uart_state;
			uint32_t scan_repeat;
			setScannerLED(0);
			if (scanCmd == SCAN_CMD_MIC_SCAN_INSTANT)
				while (HAL_GetTick() < SCAN_PACKET_DELAY);
			for (scan_repeat=0;scan_repeat<SCAN_REPEAT_RESULT; scan_repeat++) {
				do {
					uart_state = HAL_UART_GetState(&UartHandle);
				} while ((uart_state == HAL_UART_STATE_BUSY) || (uart_state == HAL_UART_STATE_BUSY_TX) || (uart_state == HAL_UART_STATE_BUSY_TX_RX));
				if(HAL_UART_Transmit_DMA(&UartHandle, ScanPacketBuf, PACKET_HDR_LEN + ScanPacketBuf[PACKET_LEN_FIELD+1])!= HAL_OK) Error_Handler();
			}
			while(1);
		}
			
